{
    "projects": [
        {
            "id":"0",
            "title":"Esports Portfolio",
            "keyskills":["React", "HTML", "CSS"],
            "image": "https://joshlee-media.s3.eu-west-2.amazonaws.com/esports-portfolio.png",
            "description":"A personal portfolio site created for a prominent Esports professional, developed using HTML/CSS and React. With a heavy focus on design and UX; resulting in a more unique and memorable experience.",
            "descriptionTwo":"It was requested the design to be minimalistic while incorporating edited pre-existing high quality media content adding visual flare to the site.",
            "featured":"true"
        },
        {
            "id":"1",
            "title":"Personal Portfolio",
            "keyskills":["React", "HTML", "CSS"],
            "image": "https://joshlee-media.s3.eu-west-2.amazonaws.com/portfolio-site.png",
            "description":"The site you are currently visiting - a place I can show off creative projects and display an understanding of different technologies. Future development will include a blog where I can share interesting ideas, relevant topics and handy guides I’ve found along the way.",
            "descriptionTwo":"Developed using HTML/CSS and React, this project provided useful insight into new development practices, and the potential benefits of using these technologies in a practical real-life use case.",
            "featured":"false"
        },
        {
            "id":"2",
            "title":"LEGO Cube Solver",
            "keyskills":["MATLAB"],
            "image": "https://joshlee-media.s3.eu-west-2.amazonaws.com/cube-solver.png",
            "description":"A project which tied together multiple areas which are of personal interest, using robotics for automation and mathematical/logical puzzles. Also utilising image categorisation in the form of colour recognition and detection.",
            "descriptionTwo":"As a child I was always intrigued by puzzles such as sudoku’s, the rules around them and the implications they can have when taken further - quickly indulging when given the opportunity to develop this project as my dissertation piece at university.",
            "featured":"false"
        },
        {
            "id":"3",
            "title":"VoIP System",
            "keyskills":["Java"],
            "image": "https://joshlee-media.s3.eu-west-2.amazonaws.com/voip.png",
            "description":"VoIP systems are a form of technology I’ve personally used and taken for granted for a long time. This project provided hands on experience with the intricacies involved with both sending and receiving voice across the internet.",
            "descriptionTwo":"Being given a variety of sockets, each one had to be analysed to identify any unwanted communication conditions, then researching and implementing solutions to provide a more functional system.",
            "featured":"false"
        },
        {
            "id":"4",
            "title":"Augmented Reality App",
            "keyskills":["Java", "HTML", "CSS"],
            "image": "https://joshlee-media.s3.eu-west-2.amazonaws.com/ar-app.png",
            "description":"Each year the University of East Anglia holds on Open Day, allowing non-students in to explore the campus and its facilities. We were tasked with producing applications that may be useful for these visitors.",
            "descriptionTwo":"An Augmented Reality application seemed like a stretch given the timeframe - but after some research and crafty workarounds it was achievable - allowing visitors to retrieve information about spots around campus on the go!",
            "featured":"false"
        },
        {
            "id":"5",
            "title":"Room Finder App",
            "keyskills":["Java", "HTML", "CSS"],
            "image": "https://joshlee-media.s3.eu-west-2.amazonaws.com/room-finder.png",
            "description":"Each year the University of East Anglia holds on Open Day, allowing non-students in to explore the campus and its facilities. We were tasked with producing applications that may be useful for these visitors.",
            "descriptionTwo":"Exploring a new campus can be daunting, especially with UEA's many walkways -  the Room finder application ensures users can find their way around campus, in case they're separated from their guide or simply want to focus on the areas that interest them the most.",
            "featured":"false"
        }
    ]
}